# -*- coding: utf-8 -*-
#+STARTUP: overview indent inlineimages
#+TITLE:       Laboratory Notebook for a Multi-Threaded Version of Quicksort
#+AUTHOR:      Arnaud Legrand
#+LANGUAGE:    en
#+TAGS: IMPORTANT(i) TEST(t) DEPRECATED(d) noexport(n)

** data/
This is where raw experimental data should go. Each directory entry
comprises a set of experiments and the directory name is based on the
machine name and on the date. For example:
#+begin_src sh :results output :exports both 
echo mkdir data/`hostname`_`date +%F`
#+end_src

#+RESULTS:
: mkdir data/sama_2014-10-13

** Compilation
A simple makefile with various compilation options is provided in the
src/ directory. Compilation is thus done by running the following command:
#+begin_src sh :results output :exports both 
make -C src/
#+end_src

#+RESULTS:
: make: Entering directory '/home/alegrand/Work/Documents/Enseignements/M2R_Eval_Perf_13/M2R-ParallelQuicksort/src'
: cc   -g -Wall -Wshadow -Wcast-align -Waggregate-return -Wmissing-prototypes -Wmissing-declarations -Wstrict-prototypes -Wmissing-prototypes -Wmissing-declarations -Wmissing-noreturn -Wpointer-arith -Wwrite-strings -finline-functions -O0 -pthread -lrt -std=c99  -c -o parallelQuicksort.o parallelQuicksort.c
: cc   -g -Wall -Wshadow -Wcast-align -Waggregate-return -Wmissing-prototypes -Wmissing-declarations -Wstrict-prototypes -Wmissing-prototypes -Wmissing-declarations -Wmissing-noreturn -Wpointer-arith -Wwrite-strings -finline-functions -O0 -pthread -lrt -std=c99  parallelQuicksort.o  -o parallelQuicksort 
: make: Leaving directory '/home/alegrand/Work/Documents/Enseignements/M2R_Eval_Perf_13/M2R-ParallelQuicksort/src'

*** Initial code design
- I obtained an initial implementation from
  http://sc12.supercomputing.org/hpceducator/PythonForParallelism/codes/parallelQuicksort.c.
  According to the header, the original author is Joshua Stough from
  Washington and Lee University. I hope he will not mind that I reuse
  this piece of code for educational purposes.
- Here is a typical first execution on my laptop (an Intel(R) Core(TM)
  i7 running a Debian with Linux 3.14.15):
  #+begin_src sh :results output :exports both 
    ./src/quicksort
  #+end_src

  #+RESULTS:
  : Sequential quicksort took: 0.231571 sec.
  : at loc 506315, 5.068226e-01 < 5.068269e-01 
  : Oops, lyst did not get sorted by parallelQuicksort.
  : Parallel quicksort took: 0.161259 sec.
  : Built-in qsort took: 0.241568 sec.

  Sweet, in my first attempt, it looks like this parallel version is
  indeed running faster than then sequential one. I have to say this
  warning message is stressing me a bit though.
- On smaller instances, the code would segfault. So I reindented the
  code and thanks to valgrind and gdb, I could find what was wrong. I
  also renamed the file so that compiling is more convenient. This
  fixed the previous warning message so now everything seems fine:
  #+begin_src sh :results output :exports both 
    ./src/parallelQuicksort
  #+end_src

  #+RESULTS:
  : Sequential quicksort took: 0.239347 sec.
  : Parallel quicksort took: 0.176365 sec.
  : Built-in quicksort took: 0.244716 sec.

*** First code execution on my laptop
- Here is a typical first execution on my laptop(an Intel(R) Core(TM)2
  Duo CPU P8600 2.40GHz * 2 running a Debian with Linux 3.2.0):
  =./src/parallelQuicksort= 
  It returns an error message:
  =ERROR; return code from pthread_create() is 11=
- When I run the code with a much smaller argument on my laptop:
  #+begin_src sh :results output :exports both 
    ./src/parallelQuicksort 500
  #+end_src

  #+RESULTS:
  : Sequential quicksort took: 0.000086 sec.
  : Parallel quicksort took: 0.019785 sec.
  : Built-in quicksort took: 0.000207 sec.
  We could see that parallel version is actually running slower than
  the sequential one.
- I found that the error is caused by "The system lacked the
  necessary resources to create another thread, or the system-imposed
  limit on the total number of threads in a process PTHREAD_THREADS_MAX
  would be exceeded."
  ref: http://stackoverflow.com/questions/7038586/return-code-from-pthread-create-is-11
- To increase the value of PTHREAD_THREADS_MAX per process in Linux, I
  have changed the value in the file =/proc/sys/kernel/threads-max= from
  =64513= to =120000= and have decreased stack size by the command =ulimit -v newvalue=
  ref: http://stackoverflow.com/questions/344203/maximum-number-of-threads-per-process-in-linux
  #+begin_src sh :results output :exports both
    ulimit -s 256
    ./src/parallelQuicksort
  #+end_src

  #+RESULTS:
  : Sequential quicksort took: 0.333926 sec.
  : Parallel quicksort took: 0.278951 sec.
  : Built-in quicksort took: 0.387445 sec.
  We could see that with the defaut argument 1000000, the parallel
  version is running faster than the sequential one.

